print("--------------------------------")
print(" Модуль 1 - КМ-42 Ільчук Іван")
print("      1 - запуск програми")
print("     0 - вихід із програми")
print("--------------------------------")
action = "" #створює порожню множину яка буде потім заповнена обраною дією
while True:
    action = input() #приймає дію 
    try: #пробує перетворити строку на ціле число
        action = int(action)
    except: #якщо не вийшло
        pass #нічого не робить
    else: #якщо вийшло
        if action == 1:
            break #продовжує виконання програми
        elif action == 0:
            quit() #закриває програму
while True: #запитує номер завдання допоки не вибереться існуюче
    task = input("Оберіть завдання для запуску: ") #записує обране завдання у змінну
    try:
        task = int(task) #пробує перетворити введений рядок на ціле число
    except: #якщо не введено ціле число
        print("Помилка при введенні номеру завдання")
    else: #якщо введено ціле число
        if task in [1,2]: #перевірка на існування завдання
            break #виходить із циклу
        else: #якщо завдання не існує
            print("Завдання", str(task),"не існує") 
match task: #запускає потрібну програму в залежності від обраного завдання
    case 1: #завдання 1
        print("---------------------------------------------")
        print("Умова: Вивести на екран п'ять рядків з нулів,\n",
              "  причому кількість нулів у кожному рядку\n",
              "          дорівнює номеру рядка.")
        print()
        print("     Натисніть enter для запуску завдання")
        print("---------------------------------------------")
        input()
        #початок програми
        print("0") #я не знаю що тут написати
        print("00")
        print("000")
        print("0000")
        print("00000")
    case 2: #завдання 2
        print("---------------------------------------------")
        print("      Умова: Підрахувати кількість цілих\n",
              "  серед чисел а, b, с (ввести з клавіатури).")
        print()
        print("     Натисніть enter для запуску завдання")
        print("---------------------------------------------")
        input()
        #початок коду завдання 2
        import sys #імпортує бібліотеку де є значення epsilon (точність значень типу float)
        while True:
            a = input("a = ") #приймає значення а (як string)
            try:
                a = float(a) #пробує перетворити на число
            except:
                print("Помилка при введенні даних\n") #видає помилку і починає цикл знов якщо не вийшло
            else:
                break #йде далі якщо вийшло

        while True:
            b = input("b = ") #приймає значення b
            try:
                b = float(b)
            except:
                print("Помилка при введенні даних\n")
            else:
                break

        while True:
            c = input("c = ") #приймає значення c
            try:
                c = float(c)
            except:
                print("Помилка при введенні даних\n")
            else:
                break 

        even_numbers = 0 #множина де буде зберігатись кількість введених цілих чисел

        for i in [a,b,c]: #повторує тіло циклу для a,b і c
            if i%1 < sys.float_info.epsilon: #порівнює дробову частину змінної із epsilon (по суті аналог i%1 == 0, але так треба робити)
                even_numbers += 1 #збільшує кількість ціли                                через те як комп'ютер зберігає дробові значення)
        print("\nКількість цілих чисел -", str(even_numbers)) #виводит кількість цілих чисел
    #кінець match оператору
print("\nКінець програми")
