print("--------------------------------")
print(" Модуль 2 - КМ-42 Ільчук Іван")
print("      1 - запуск програми")
print("     0 - вихід із програми")
print("--------------------------------")
action = "" #створює порожню множину яка буде потім заповнена обраною дією
while True:
    action = input() #приймає дію 
    try: #пробує перетворити строку на ціле число
        action = int(action)
    except: #якщо не вийшло
        pass #нічого не робить
    else: #якщо вийшло
        if action == 1:
            break #продовжує виконання програми
        elif action == 0:
            quit() #закриває програму
while True: #запитує номер завдання допоки не вибереться існуюче
    task = input("Оберіть завдання для запуску: ") #записує обране завдання у змінну
    try:
        task = int(task) #пробує перетворити введений рядок на ціле число
    except: #якщо не введено ціле число
        print("Помилка при введенні номеру завдання")
    else: #якщо введено ціле число
        if task in [1,2]: #перевірка на існування завдання
            break #виходить із циклу
        else: #якщо завдання не існує
            print("Завдання", str(task),"не існує") 
match task:
    case 1:
        print("---------------------------------------------")
        print("   Умова: Обчислити Product[x^i+i,{i,1,n}]\n") #я не знаю як це інакше текстом описати
        print("     Натисніть enter для запуску завдання")
        print("---------------------------------------------")
        input()
        while True:
            n = input("n = ") #задає значення n
            try:
                n = int(n)
            except ValueError: #видає при ValueError (введено не ціле число)
                print("Помилка - n має бути цілим числом\n")
            except: #видає при інших помилках
                print("Помилка\n")
            else:
                break #йде далі по програмі
        while True:
            x = input("x = ") #задає значення x
            try:
                x = float(x)
            except ValueError: #видає при ValueError (введено не число)
                print("Помилка - x має бути числом\n")
            except: #видає при інших помилках
                print("Помилка\n")
            else:
                break
        total = 1 #добуток усіх чисел, які були вже обраховані
        for i in range(1,n+1):  #+1 тому що функція добутку повторюється включно, а for i in range(...) не включно
            total *= (x ** i) + i #множить добуток усіх попередніх чисел на наступне число у послідовності
        print("Кінцеве значення =",str(total)) #виводить значення добутку
    case 2:
        while True:
            number = input("Введіть число:") #задає значення n
            try:
                number = int(number)
            except ValueError: #видає при ValueError (введено не ціле число)
                print("Помилка - введіть ціле число\n")
            except: #видає при інших помилках
                print("Помилка\n")
            else:
                break #йде далі по програмі
        has_twos = False # чи є в числу двійка (спочатку задано що нема)
        while number > 0: #повторює тіло циклу до того як в числі не закінчаться цифри
            if number % 10 == 2:  #перевіряє останню цифру в числі (остача від ділення на 10)
                has_twos = True  #міняє змінну на істину якщо остача є двійкою
            number = number // 10 #прибирає останню цифру в числі (ділення на 10 без остачі)
        if has_twos: #виводить текст в залежності від присутності цифри  2
            print("У введеному числі присутня цифра 2")
        else:
            print("У введеному числі відсутня цифра 2")

print("\nКінець програми")
