
print("-"*45)
print('        Модуль 6 - КМ-42 Ільчук Іван')
print('             1 - запуск програми')
print('            0 - вихід із програми')
print("-"*45)
action = "" #створює порожню змінну яка буде потім заповнена обраною дією
while True:
    action = input() #приймає дію 
    try: #пробує перетворити строку на ціле число
        action = int(action)
    except: #якщо не вийшло
        pass #нічого не робить
    else: #якщо вийшло
        if action == 1:
            break #продовжує виконання програми
        elif action == 0:
            quit() #закриває програму

while True: #запитує номер завдання допоки не вибереться існуюче
    task = input("Оберіть завдання для запуску: ") #записує обране завдання у змінну
    try:
        task = int(task) #пробує перетворити введений рядок на ціле число
    except: #якщо не введено ціле число
        print("Помилка при введенні номеру завдання")
    else: #якщо введено ціле число
        if task in [1,2]: #перевірка на існування завдання
            break #виходить із циклу
        else: #якщо завдання не існує
            print("Завдання", str(task),"не існує") 

match task: #запускає потрібну програму в залежності від обраного завдання
    case 1: #завдання 1
        print("-"*82)
        print("      Увести одновимірний масив числових значень, що нараховує n елементів.       ")
        print("    Після кожного від'ємного елемента вставити новий елемент, рівний квадрату     ")
        print("                            цього від'ємного елементу.                            ")
        print("-"*82)
        input("Натисніть enter для запуску завдання")

        import numpy as np
        print("Введіть \"stop\" щоб завершити введення значень в масив")
        arr = np.array([]) #вхідний масив
        while True:
            num = input("Введіть значення: ")
            if num == "stop": #зупиняє введення якщо введено команду stop
                break
            else:
                try:
                    num = np.array([float(num)]) #пробує перетворити введений рядок на одноелементний масив із float-значенням щоб потім викликати команду hstack 
                except:
                    print("Недопустиме значення")
                else:
                    arr = np.hstack((arr,num)) #додає елемент до масиву

        arr1 = np.array([]) #вихідний масив
        for i in arr: #перевіряє кожний елемент у вхідному масиві
            if i < 0: 
                arr1 = np.hstack((arr1, np.array([i,i**2]))) #додає сам елемент і його квадрат якщо він від'ємний
            else:
                arr1 = np.hstack((arr1, np.array([i]))) #додає сам елемент

        print("Вихідний масив:",list(arr1),end="") #виводить вихідний масив

    case 2: #завдання 2
        print("-"*82)
        print("                    Заповнити матрицю ЛП, від лівого нижнього                     ")
        print("                        кута по діагоналі: уліво - нагору.                        ")
        print("-"*82)
        input("Натисніть enter для запуску завдання")
        import numpy as np
        while True: 
            a = input("Введіть кількість стовпців: ")
            try:
                a = int(a) 
                assert a >= 0
            except Exception: 
                print("Недопустимий розмір матриці")
            else:
                break
        while True: 
            b = input("Введіть кількість рядків: ")
            try:
                b = int(b) 
                assert b >= 0
            except Exception: 
                print("Недопустимий розмір матриці")
            else:
                break
        matrix = np.zeros((a,b))

        def fill_matrix(matrix):
            base_x = 0 #основа першої діагоналі (лівий нижній кут)
            base_y = a - 1

            counter = 1 #лічильник = те число, яке буде записуватися в точку матриці

            def fill_diag(): #заповнює 1 діагональ починаючи з основи (усе глобальне бо я лінивий)
                nonlocal matrix,base_x,base_y,counter
                matrix[base_y,base_x] = counter #ставить початковій точці у діагоналі значення лічильнику
                counter += 1

                point_x = base_x - 1 #ставить координати вказнівику ліворуч і вгору від основи
                point_y = base_y - 1
                
                ###print(f"point_x = {base_x - 1}")
                ###print(f"point_y = {base_y - 1}")

                while point_x >= 0 and point_y >= 0: #поки не вилетіли із матриці
                    matrix[point_y,point_x] = counter 
                    counter += 1
                    #рухає вказівник ліворуч і вгору
                    point_x -= 1
                    point_y -= 1
                ###print(matrix)

            while base_x <= b - 1: #заповнює діагоналі поки не вилетіли з правого краю матриці
                fill_diag()
                base_x += 1 #рухає основу ліворуч

            base_x -= 1 #заносить основу діагоналі назад до матриці
            base_y -= 1 #рухає основу на 1 крок догори

            while base_y >= 0: #поки не вилетіли з верхнього краю матриці
                fill_diag()
                base_y -= 1 #рухає основу догори

        fill_matrix(matrix)
        print(matrix)

       
    #кінець match оператору


print("\nКінець програми")