
print("-"*45)
print('        Модуль 7 - КМ-42 Ільчук Іван')
print('             1 - запуск програми')
print('            0 - вихід із програми')
print("-"*45)
action = "" #створює порожню змінну яка буде потім заповнена обраною дією
while True:
    action = input() #приймає дію 
    try: #пробує перетворити строку на ціле число
        action = int(action)
    except: #якщо не вийшло
        pass #нічого не робить
    else: #якщо вийшло
        if action == 1:
            break #продовжує виконання програми
        elif action == 0:
            quit() #закриває програму

while True: #запитує номер завдання допоки не вибереться існуюче
    task = input("Оберіть завдання для запуску: ") #записує обране завдання у змінну
    try:
        task = int(task) #пробує перетворити введений рядок на ціле число
    except: #якщо не введено ціле число
        print("Помилка при введенні номеру завдання")
    else: #якщо введено ціле число
        if task == 1: #перевірка на існування завдання
            break #виходить із циклу
        else: #якщо завдання не існує
            print("Завдання", str(task),"не існує") 

match task: #запускає потрібну програму в залежності від обраного завдання
    case 1: #завдання 1
        print("-"*82)
        print("     Записати в текстовий файл квадрати чисел від 1 до 10 (кожен на окремому      ")
        print("                                     рядку).                                      ")
        print("                            Список не використовувати.                            ")
        print("-"*82)
        input("Натисніть enter для запуску завдання")

        with open("output.txt", "w") as fi: #відкриваємо файл output.txt як fi
            for i in range(1,11):
                fi.write(f"{i**2}\n") #записуємо квадрат числа в файл

        print("Дані записано у файл output.txt")
    #кінець match оператору


print("\nКінець програми")
#не розумію чому jdoodle не показує що було згенеровано файл але на комп'ютері він створюється
